package com.ict03.class03;

public class Ex01 extends Object{

	public static void main(String[] args) {
//		상속 관계 : 클래스와 클래스의 관계(is a 관계)
//		자식 클래스가 부모 클래스의 멤버를 제약없이 사용
//		형식 : 자바클래스 extends 부모클래스
//		특징 : 자바에선 다중 상속을 할 수 없음(인터페이스는 예외)
//		부모 클래스가 하나만 존재, 모든 클래스는 Object 클래스를 상속받고 있다.
//		부모(super), 자식(sub)
		
//		오버라이딩(재정의) : 상속 받은 메소드를 자식 클래스에서 수정해서 사용
//		 ㄴ오버라이딩 시 부모의 메소드가 숨겨짐(은닉화)
		
//		final 메소드 : 부모 클래스가 가진 메소드를 자식 클래스가 오버라이딩 못 하게 함
//		final 클래스 : 상속 금지(자식 클래스 생성 불가)
//		final 변수 : 상수(데이터 변경 금지)
		
	}
}
