package com.ict08.network;

public class Ex05 {
//	xml : extensible markup language(확장성 마크업 언어)
//	html을 개선한 언어
//	정해진 태그를 사용해서 웹 페이지를 만듦
//	태그 : <시작태그 속성="값"> 텍스트 </끝태그>
//	태그의 의미를 w3c에서 이미 정해둠
//	그러나 xml은 사용자가 태그를 만들고 태그에 의미를 부여할 수 있음 
//	xml은 반드시 첫 줄에 <?xml version="1.0" encoding="UTF-8" standalone="no" ?> 사용
//	xml은 데이터 전달이나 환경설정 시 많이 사용
//	JSON(JavaScript Object Notation) : 키:값 쌍으로 이루어진 데이터 오브젝트를 전달하기 위해
//	인간이 읽을 수 있는 텍스르를 사용하는 개방형 표준 포맷
//	{
//	"이름": "홍길동"
//	"나이": 25,
//	"성별": "여",
//	"주소": "서울",
//	"특기": ["농구", "도술"], // 키:값(배열)
//	"가족관계": {"#": 2, "아버지": "홍판서", "어머니": "춘섬"}, // 키:값(json)
//	}
}